app/Controllers/Category.php

SELECT *
FROM `category`
---
    public function goCategory(): string
    {
        $category = new categoryModel();
        $data['category'] = $category->findAll();