app/Controllers/Vehicle.php

public function goAddvehicle(): string
{
    $categoryModel = new categoryModel();
    $vehicle = new vehicleModel();
    $categories = $categoryModel->findAll();
    $vehicles= $vehicle->findAll();
    $vehicleData = [];
    foreach ($categories as $category)
    {
        $vehicle_type = $category['vehicle_type'];
        $vehicle_limit = $category['vehicle_limit'];
        $parking_area_no = $category['parking_area_no'];
        $parking_charge = $category['parking_charge'];
        // Récupérer le nombre de véhicules stationnés (status = 0) pour ce type de véhicule
        $parkedCount = $vehicle
            ->where('vehicle_type', $vehicle_type)
            ->where('status', '0') // Véhicules stationnés
            ->countAllResults();
        //Controller automatiquement le status de disponiblilité du parking par categories
        // Comparer avec la capacité maximale de la catégorie avec le nombre de vehicules garés
        if ($parkedCount >= $category['vehicle_limit']) {
            // Mettre à jour le statut de la catégorie à '1'
            $categoryModel->update($category['cat_id'], ['status' => '1']);
        } else {
            // Si la capacité n'est pas atteinte, marquer comme '0'
            $categoryModel->update($category['cat_id'], ['status' => '0']);
---
SELECT *
FROM `category`
UPDATE `category` SET `status` = '0'
WHERE `category`.`cat_id` IN ('1')

public function addVehicle()
{
    $vehicle = new vehicleModel();
    $data = [
        'vehicle_no'=>$this->request->getPost('vehicle_number'),
        'vehicle_type'=>$this->request->getPost('vehicle_type'),
        'parking_area_no'=>$this->request->getPost('parking_area_no'),
        'parking_charge'=>$this->request->getPost('parking_charge')
    ];
    $vehicle->save($data);
---
INSERT INTO `add_vehicle` (`vehicle_no`, `vehicle_type`, `parking_area_no`, `parking_charge`) VALUES ('T16', 'Pickup ', '7', '10')

public function goManagevehicle(): string
{
   $vehicle = new vehicleModel();
     // Configure la pagination
     $perPage = 8; // Nombre de résultats par page
     $currentPage = $this->request->getVar('page') ?? 1;

     $vehicles = $vehicle->paginate($perPage, 'vehicle');
---
SELECT *
FROM `add_vehicle`
 LIMIT 8, 8
SELECT COUNT(*) AS `numrows`
FROM `add_vehicle`