app/Models/categoryModel.php

SELECT DISTINCT `vehicle_type`
FROM `category`
---
    public function getVehicleTypes()
    {
        return $this->select('vehicle_type')->distinct()->findAll();