app/Models/vehicleModel.php

SELECT *
FROM `add_vehicle`
---
        $builder->where('status', $filters['status']);
    }

    return $builder->get()->getResultArray();